Тест_ЗУП_31_КОРП/src/Enums/ФормыОплаты/ФормыОплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ФормыОплаты</name>
  <enumValues>
    <name>Наличная</name>
  </enumValues>
  <enumValues>
    <name>Безналичная</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Enums/КатегорииДоходовНДФЛ/КатегорииДоходовНДФЛ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КатегорииДоходовНДФЛ</name>
  <enumValues>
    <name>ОплатаТруда</name>
  </enumValues>
  <enumValues>
    <name>ДоходВНатуральнойФормеОтТрудовойДеятельности</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеНатуральныеДоходы</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеДоходыВДенежнойФормеОтТрудовойДеятельности</name>
  </enumValues>
  <enumValues>
    <name>Дивиденды</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеДоходы</name>
  </enumValues>
  <enumValues>
    <name>ДивидендыПоСтавке05</name>
  </enumValues>
  <enumValues>
    <name>ДивидендыПоСтавке10</name>
  </enumValues>
  <enumValues>
    <name>ДивидендыПоСтавке12</name>
  </enumValues>
  <enumValues>
    <name>АвторскиеРоялтиПоСтавке03</name>
  </enumValues>
  <enumValues>
    <name>АвторскиеРоялтиПроцентыПоСтавке05</name>
  </enumValues>
  <enumValues>
    <name>АвторскиеРоялтиПоСтавке06</name>
  </enumValues>
  <enumValues>
    <name>АвторскиеРоялтиПроцентыПоСтавке07</name>
  </enumValues>
  <enumValues>
    <name>АвторскиеРоялтиПроцентыПоСтавке10</name>
  </enumValues>
  <enumValues>
    <name>АвторскиеРоялтиПроцентыПоСтавке15</name>
  </enumValues>
  <enumValues>
    <name>ДоходыПредыдущихРедакций</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Documents/ВыдачаЗаймаСотруднику/ВыдачаЗаймаСотруднику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыдачаЗаймаСотруднику</name>
  <basedOn>Catalog.Сотрудники</basedOn>
  <basedOn>Document.ДоговорЗаймаСотруднику</basedOn>
  <registerRecords>AccumulationRegister.ВзаиморасчетыПоЗаймамСотрудникам</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорЗайма</name>
    <type>
      <types>DocumentRef.ДоговорЗаймаСотруднику</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормаРасчетов</name>
    <type>
      <types>EnumRef.ФормыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

Тест_ЗУП_31_КОРП/src/Documents/ПогашениеЗаймаСотруднику/ПогашениеЗаймаСотруднику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПогашениеЗаймаСотруднику</name>
  <basedOn>Catalog.Сотрудники</basedOn>
  <basedOn>Document.ДоговорЗаймаСотруднику</basedOn>
  <registerRecords>AccumulationRegister.РасчетыНалогоплательщиковСБюджетомПоНДФЛ</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>AccumulationRegister.НачисленияУдержанияПоСотрудникам</registerRecords>
  <registerRecords>AccumulationRegister.БухгалтерскиеВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>AccumulationRegister.СведенияОДоходахНДФЛ</registerRecords>
  <registerRecords>AccumulationRegister.БухучетНачисленияУдержанияПоСотрудникам</registerRecords>
  <registerRecords>AccumulationRegister.ЗарплатаКВыплате</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыПоЗаймамСотрудникам</registerRecords>
  <registerRecords>AccumulationRegister.АвансовыеПлатежиИностранцевПоНДФЛ</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорЗайма</name>
    <type>
      <types>DocumentRef.ДоговорЗаймаСотруднику</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормаРасчетов</name>
    <type>
      <types>EnumRef.ФормыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

Тест_ЗУП_31_КОРП/src/CommonModules/ЗаймыСотрудникамВХО/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Займы сотрудникам".
// Процедуры и функции, предназначенные для обслуживания выданных сотрудникам займов.
//  
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Определяет необходимость заполнения формы расчетов в документах выдачи/погашения займов.
//
// Параметры:
//	Организация
//
// Возвращаемое значение - булево.
//
Функция УточнятьФормуРасчетовПриВыдачеПогашенииЗайма(Организация) Экспорт
	
	// Уточняем форму расчетов, если используется обмен с бухгалтерией.
	
	// ЗарплатаКадрыПриложения.ОбменЗарплата3Бухгалтерия3
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ОбменЗарплата3Бухгалтерия3") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("ОбменДаннымиЗарплата3Бухгалтерия3");
		Возврат Модуль.ОбменИспользуется(Организация);
	КонецЕсли;
	// Конец ЗарплатаКадрыПриложения.ОбменЗарплата3Бухгалтерия3
	
	Возврат Ложь;
	
КонецФункции

// Возвращает массив документов ВыдачаЗаймаСотруднику, оформленных по договору.
//
// Параметры:
//	ДоговорЗайма - ссылка на документ ДоговорЗаймаСотруднику.
//
Функция ДокументыВыдачиЗайма(ДоговорЗайма) Экспорт 
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ДоговорЗайма", ДоговорЗайма);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВыдачаЗаймаСотруднику.Ссылка
	               |ИЗ
	               |	Документ.ВыдачаЗаймаСотруднику КАК ВыдачаЗаймаСотруднику
	               |ГДЕ
	               |	ВыдачаЗаймаСотруднику.Проведен
	               |	И ВыдачаЗаймаСотруднику.ДоговорЗайма = &ДоговорЗайма";
				   
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Процедура ЗаполнитьФормуРасчетовВДокументахЗаймаСотруднику() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВыдачаЗаймаСотруднику.Ссылка
	|ИЗ
	|	Документ.ВыдачаЗаймаСотруднику КАК ВыдачаЗаймаСотруднику
	|ГДЕ
	|	ВыдачаЗаймаСотруднику.ФормаРасчетов = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПогашениеЗаймаСотруднику.Ссылка
	|ИЗ
	|	Документ.ПогашениеЗаймаСотруднику КАК ПогашениеЗаймаСотруднику
	|ГДЕ
	|	ПогашениеЗаймаСотруднику.ФормаРасчетов = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.ПустаяСсылка)";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокОбъект.ОбменДанными.Загрузка = Истина;
		ДокОбъект.ФормаРасчетов = Перечисления.ФормыОплаты.Наличная;
		ДокОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

// Определяет имя таблицы документа внеочередного погашения займа сотрудником.
//
Процедура ЗаполнитьИмяДокументаПогашенияЗайма(ДокументПогашения) Экспорт
	ДокументПогашения = Метаданные.Документы.ПогашениеЗаймаСотруднику.ПолноеИмя();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Определяет объекты, в которых есть процедура ДобавитьКомандыПечати().
// Подробнее см. УправлениеПечатьюПереопределяемый.
//
// Параметры:
//  СписокОбъектов - Массив - список менеджеров объектов.
//
Процедура ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт
	
	СписокОбъектов.Добавить(Документы.ВыдачаЗаймаСотруднику);
	СписокОбъектов.Добавить(Документы.ПогашениеЗаймаСотруднику);
	
КонецПроцедуры

Процедура ЗаполнитьКатегориюДоходаВДвиженияхПогашениеЗаймаСотрудникуПоРегиструСведенияОДоходахНДФЛ(ПараметрыОбновления = Неопределено) Экспорт 

	УчетФактическиПолученныхДоходовРасширенный.ЗаполнитьКатегориюДоходаВДвиженияхОсобогоДокументаПоРегиструСведенияОДоходахНДФЛ("ПогашениеЗаймаСотруднику", Перечисления.КатегорииДоходовНДФЛ.ПрочиеНатуральныеДоходы, ПараметрыОбновления)	

КонецПроцедуры

Процедура ЗаполнитьКатегориюДоходаВДвиженияхПогашениеЗаймаСотрудникуПоРегиструРасчетыНалогоплательщиковСБюджетомПоНДФЛ(ПараметрыОбновления = Неопределено) Экспорт 

	УчетФактическиПолученныхДоходовРасширенный.ЗаполнитьКатегориюДоходаВДвиженияхОсобогоДокументаПоРегиструРасчетыНалогоплательщиковСБюджетомПоНДФЛ("ПогашениеЗаймаСотруднику", Перечисления.КатегорииДоходовНДФЛ.ПрочиеНатуральныеДоходы, ПараметрыОбновления)	

КонецПроцедуры

#КонецОбласти
